ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
      <registers>

        <!-- REG0: Power Sequencer Control Register 0 -->
        <register>
          <name>REG0</name>
          <description>Power Sequencer Control Register 0</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_lp1</name>
              <description>Shutdown Power Mode Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_first_boot</name>
              <description>Wake on First Boot</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_sys_reboot</name>
              <description>Firmware System Reboot Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>pwr_flashen_run</name>
              <description>Enable Flash Operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_flashen_slp</name>
              <description>Enable Flash Operation during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_retregen_run</name>
              <description>Enable Retention Regulator Operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_retregen_slp</name>
              <description>Enable Retention Regulator Operation during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_roen_run</name>
              <description>Enable 96MHz System Relaxation Oscillator in Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_roen_slp</name>
              <description>Enable 96MHz System Relaxation Oscillator in Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_nren_run</name>
              <description>Enable Nano Oscillator in Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_nren_slp</name>
              <description>Enable Nano Oscillator in Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_rtcen_run</name>
              <description>Enable Real Time Clock Operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_rtcen_slp</name>
              <description>Enable Real Time Clock Operation during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm12en_run</name>
              <description>Enable VDD12_SW SVM operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm18en_run</name>
              <description>Enable VDD18_SW SVM operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svmrtcen_run</name>
              <description>Enable VRTC SVM operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm_vddb_run</name>
              <description>Enable VDDB SVM operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svmtvdd12en_run</name>
              <description>Enable TVDD12 SVM operation during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd12_swen_run</name>
              <description>Enable VDD12 switching during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd12_swen_slp</name>
              <description>Enable VDD12 switching during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd18_swen_run</name>
              <description>Enable VDD18 switching during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd18_swen_slp</name>
              <description>Enable VDD18 switching during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_swen_run</name>
              <description>Enable TVDD12 switching during Run Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_swen_slp</name>
              <description>Enable TVDD12 switching during Sleep Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_rcen_run</name>
              <description>Enable 4MHz RC oscillator operation during Run Mode for LP2 and LP3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_rcen_slp</name>
              <description>Enable 4MHz RC oscillator operation during Sleep Mode for LP1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_osc_select</name>
              <description>Select Primary System Oscillator 96MHz or 4MHz</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG1: Power Sequencer Control Register 1 -->
        <register>
          <name>REG1</name>
          <description>Power Sequencer Control Register 1</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_clr_io_event_latch</name>
              <description>Clear all GPIO Event Seen Latches</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_clr_io_cfg_latch</name>
              <description>Clear all GPIO Configuration Latches</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_mbus_gate</name>
              <description>Freeze GPIO MBus State</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_discharge_en</name>
              <description>Enable Flash Discharge During Powerfail Event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_well</name>
              <description>TVDD12 Well Switch</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_sram_nwell_sw</name>
              <description>SRAM n-Well Switch</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_auto_mbus_gate</name>
              <description>Automatically Set/Clear GPIO MBus Gate</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm_vddio_en_run</name>
              <description>Enable VDDIO SVM Run for LP2 and LP3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm_vddioh_en_run</name>
              <description>Enable VDDIOH SVM Run for LP2 and LP3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_retreg_src_v12</name>
              <description>Enable VDDIO SVM Run for LP2 and LP3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_retreg_src_vrtc</name>
              <description>Enables VRTC Rail as Retention Power Su</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_retreg_src_v18</name>
              <description>Enables VDD18 Rail as Retention Power Supply</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddio_en_iso_por</name>
              <description>Enable VDDIO Isolation POR</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddioh_en_iso_por</name>
              <description>Enable VDDIOH Isolation POR</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_lp0_core_resume_en</name>
              <description>Enable Core Resume to Toggle during LP0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_lp1_core_rstn_en</name>
              <description>Enable Core RSTN to Toggle during LP1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG2: Power Sequencer Control Register 2 -->
        <register>
          <name>REG2</name>
          <description>Power Sequencer Control Register 2</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_vdd12_hyst</name>
              <description>VDD12_SW Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd18_hyst</name>
              <description>VDD18_SW Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vrtc_hyst</name>
              <description>VRTC Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddb_hyst</name>
              <description>VDDB Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_hyst</name>
              <description>TVDD12 Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddio_hyst</name>
              <description>VDDIO Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddioh_hyst</name>
              <description>VDDIO Comparator Hysteresis Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

