ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- FLAGS: Power Sequencer Flags -->
        <register>
          <name>FLAGS</name>
          <description>Power Sequencer Flags</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_first_boot</name>
              <description>Initial Boot event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwr_sys_reboot</name>
              <description>Firmware Reset event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwr_power_fail</name>
              <description>Power Fail event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_boot_fail</name>
              <description>Boot Fail event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_flash_discharge</name>
              <description>Flash Discharged During Powerfail event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_iowakeup</name>
              <description>GPIO Wakeup event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vdd12_rst_bad</name>
              <description>VDD12_SW Comparator Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vdd18_rst_bad</name>
              <description>VDD18_SW Comparator Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vrtc_rst_bad</name>
              <description>VRTC Comparator Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vddb_rst_bad</name>
              <description>VDDB Comparator Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_tvdd12_rst_bad</name>
              <description>TVDD12 Comparator Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_por18z_fail_latch</name>
              <description>POR18 and POR18_bg have been tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rtc_cmpr0</name>
              <description>RTC Comparator 0 Match event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rtc_cmpr1</name>
              <description>RTC Comparator 1 Match event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rtc_prescale_cmp</name>
              <description>RTC Prescale Comparator Match event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rtc_rollover</name>
              <description>RTC Rollover event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pwr_usb_plug_wakeup</name>
              <description>USB Power Connect Wakeup event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_usb_remove_wakeup</name>
              <description>USB Power Remove Wakeup event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_tvdd12_bad</name>
              <description>Retention Regulator POR Tripped event detected flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vddio_rst_bad</name>
              <description>VDDIO Comparator Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vddioh_rst_bad</name>
              <description>VDDIOH Comparator Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_isoz_vddio_fail</name>
              <description>VDDIO Isolation POR Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_isoz_vddioh_fail</name>
              <description>VDDIOH Isolation POR Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_nanoring_wakeup_flag</name>
              <description>Wakeup Triggered by Nanoring Wakeup</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_watchdog_rstn_flag</name>
              <description>Power Sequencer Reset Triggered by Watchdog Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- MSK_FLAGS: Power Sequencer Flags Mask Register -->
        <register>
          <name>MSK_FLAGS</name>
          <description>Power Sequencer Flags Mask Register</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_sys_reboot</name>
              <description>Mask for system reboot detect</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_power_fail</name>
              <description>Mask for previous power fail detect</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_boot_fail</name>
              <description>Mask for previous boot fail detect</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_flash_discharge</name>
              <description>Mask for flash discharge event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_iowakeup</name>
              <description>Mask for GPIO wakeup event detect</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd12_rst_bad</name>
              <description>Mask for VDD12 rst event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vdd18_rst_bad</name>
              <description>Mask for VDD18 rst event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vrtc_rst_bad</name>
              <description>Mask for VRTC rst event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddb_rst_bad</name>
              <description>Mask for VDDB rst event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_rst_bad</name>
              <description>Mask for TVDD12 rst event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_por18z_fail_latch</name>
              <description>Mask for POR18 powerfail event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc_cmpr0</name>
              <description>Mask for RTC compare 0 event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc_cmpr1</name>
              <description>Mask for RTC compare 1 event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc_prescale_cmp</name>
              <description>Mask for RTC prescale compare event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc_rollover</name>
              <description>Mask for RTC rollover event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_usb_plug_wakeup</name>
              <description>Mask for USB plug connect event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_usb_remove_wakeup</name>
              <description>Mask for USB plug disconnect event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tvdd12_bad</name>
              <description>Mask for TVDD12 power fail event</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_vddio_rst_bad</name>
              <description>Mask for VDDIO Comparator Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_vddioh_rst_bad</name>
              <description>Mask for VDDIOH Comparator Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_isoz_vddio_fail</name>
              <description>Mask for VDDIO Isolation POR Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_isoz_vddioh_fail</name>
              <description>Mask for VDDIOH Isolation POR Tripped</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_nanoring_wakeup_flag</name>
              <description>Mask for Wakeup Triggered by Nanoring Wakeup</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>pwr_watchdog_rstn_flag</name>
              <description>Mask for Power Sequencer Reset Triggered by Watchdog Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_PROTECT</name>
          <description>Critical Setting Write Protect Register</description>
          <addressOffset>0x002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>bypass_seq</name>
              <description>Write Protect Bypass Sequence Write</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc_seq</name>
              <description>Write Protect RTC Sequence Write</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rtc</name>
              <description>Write Protect from RTC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>info</name>
              <description>Write Protect from Info Block</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bypass</name>
              <description>Write Protect Bypass</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>wp</name>
              <description>Critical Setting Write Protect</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RETN_CTRL0</name>
          <description>Retention Control Register 0</description>
          <addressOffset>0x0030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>retn_ctrl_en</name>
              <description>Retention Controller Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rc_rel_ccg_early</name>
              <description>Early Core Clock Gate Release</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rc_use_flc_twk</name>
              <description>Enable Flash Controller TWake Timer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rc_poll_flash</name>
              <description>Enable Automatic Flash Polling for Wakeup</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RETN_CTRL1</name>
          <description>Retention Control Register 1</description>
          <addressOffset>0x0034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>rtc_twk</name>
              <description>Retention Controller TWake Cycle Count</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_MISC</name>
          <description>Power Misc Controls</description>
          <addressOffset>0x0038</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>invert_4_mask_bits</name>
              <description>Invert Sense of Power Mask Flags for RTC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_CTRL2</name>
          <description>RTC Misc Controls</description>
          <addressOffset>0x003C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>timer_async_rd</name>
              <description></description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer_async_wr</name>
              <description></description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer_auto_update</name>
              <description></description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ssb_performance</name>
              <description></description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
