ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- ALI_CONNECT0: Analog I/O Connection Control Register 0 -->
        <register>
          <name>ALI_CONNECT0</name>
          <description>Analog I/O Connection Control Register 0</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
        </register>

        <!-- ALI_CONNECT1: Analog I/O Connection Control Register 1 -->
        <register>
          <name>ALI_CONNECT1</name>
          <description>Analog I/O Connection Control Register 1</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
        </register>

        <!-- SPIX_REQ: SPIX I/O Mode Request -->
        <register>
          <name>SPIX_REQ</name>
          <description>SPIX I/O Mode Request</description>
          <addressOffset>0x0028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_req</name>
              <description>SPIX Core I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss0_io_req</name>
              <description>SPIX SS[0] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss1_io_req</name>
              <description>SPIX SS[1] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss2_io_req</name>
              <description>SPIX SS[2] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>quad_io_req</name>
              <description>SPIX Quad I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPIX Fast Mode Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SPIX_ACK: SPIX I/O Mode Acknowledge -->
        <register>
          <name>SPIX_ACK</name>
          <description>SPIX I/O Mode Acknowledge</description>
          <addressOffset>0x002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_ack</name>
              <description>SPIX Core I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss0_io_ack</name>
              <description>SPIX SS[0] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss1_io_ack</name>
              <description>SPIX SS[1] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss2_io_ack</name>
              <description>SPIX SS[2] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_ack</name>
              <description>SPIX Quad I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPIX Fast Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- UART0_REQ: UART0 I/O Mode Request -->
        <register>
          <name>UART0_REQ</name>
          <description>UART0 I/O Mode Request</description>
          <addressOffset>0x0030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART0 TX/RX I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART0 CTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART0 RTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART0 TX/RX I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART0 CTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART0 RTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- UART0_ACK: UART0 I/O Mode Acknowledge -->
        <register>
          <name>UART0_ACK</name>
          <description>UART0 I/O Mode Acknowledge</description>
          <addressOffset>0x0034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART0 TX/RX I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART0 CTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART0 RTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART0 TX/RX I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART0 CTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART0 RTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- UART1_REQ: UART1 I/O Mode Request -->
        <register>
          <name>UART1_REQ</name>
          <description>UART1 I/O Mode Request</description>
          <addressOffset>0x0038</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART1 TX/RX I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART1 CTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART1 RTS I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART1 TX/RX I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART1 CTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART1 RTS I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- UART1_ACK: UART1 I/O Mode Acknowledge -->
        <register>
          <name>UART1_ACK</name>
          <description>UART1 I/O Mode Acknowledge</description>
          <addressOffset>0x003C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_map</name>
              <description>UART1 TX/RX I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_map</name>
              <description>UART1 CTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_map</name>
              <description>UART1 RTS I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>io_req</name>
              <description>UART1 TX/RX I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_io_req</name>
              <description>UART1 CTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rts_io_req</name>
              <description>UART1 RTS I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

