ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- I2CM0_ACK: I2C Master 0 I/O Acknowledge -->
        <register>
          <name>I2CM0_ACK</name>
          <description>I2C Master 0 I/O Acknowledge</description>
          <addressOffset>0x0054</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_ack</name>
              <description>I2C Master 0 I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- I2CM1_REQ: I2C Master 1 I/O Request -->
        <register>
          <name>I2CM1_REQ</name>
          <description>I2C Master 1 I/O Request</description>
          <addressOffset>0x0058</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_req</name>
              <description>I2C Master 1 I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- I2CM1_ACK: I2C Master 1 I/O Acknowledge -->
        <register>
          <name>I2CM1_ACK</name>
          <description>I2C Master 1 I/O Acknowledge</description>
          <addressOffset>0x005C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_ack</name>
              <description>I2C Master 1 I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- I2CM2_REQ: I2C Master 2 I/O Request -->
        <register>
          <name>I2CM2_REQ</name>
          <description>I2C Master 2 I/O Request</description>
          <addressOffset>0x0060</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_req</name>
              <description>I2C Master 2 I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- I2CM2_ACK: I2C Master 2 I/O Acknowledge -->
        <register>
          <name>I2CM2_ACK</name>
          <description>I2C Master 2 I/O Acknowledge</description>
          <addressOffset>0x0064</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_ack</name>
              <description>I2C Master 2 I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- I2CS_REQ: I2C Slave I/O Request -->
        <register>
          <name>I2CS_REQ</name>
          <description>I2C Slave I/O Request</description>
          <addressOffset>0x0068</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_sel</name>
              <description>I2C Slave I/O Mapping Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mapping_req</name>
              <description>I2C Slave I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- I2CS_ACK: I2C Slave I/O Acknowledge -->
        <register>
          <name>I2CS_ACK</name>
          <description>I2C Slave I/O Acknowledge</description>
          <addressOffset>0x006C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>io_sel</name>
              <description>I2C Slave I/O Mapping Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>mapping_ack</name>
              <description>I2C Slave I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- SPI0_REQ: SPI Master 0 I/O Mode Request -->
        <register>
          <name>SPI0_REQ</name>
          <description>SPI Master 0 I/O Mode Request</description>
          <addressOffset>0x0070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_req</name>
              <description>SPI Master 0 Core I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss0_io_req</name>
              <description>SPI Master 0 SS[0] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss1_io_req</name>
              <description>SPI Master 0 SS[1] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss2_io_req</name>
              <description>SPI Master 0 SS[2] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss3_io_req</name>
              <description>SPI Master 0 SS[3] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss4_io_req</name>
              <description>SPI Master 0 SS[4] I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>quad_io_req</name>
              <description>SPI Master 0 Quad I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 0 Fast Mode Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SPI0_ACK: SPI Master 0 I/O Mode Acknowledge -->
        <register>
          <name>SPI0_ACK</name>
          <description>SPI Master 0 I/O Mode Acknowledge</description>
          <addressOffset>0x0074</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_ack</name>
              <description>SPI Master 0 Core I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss0_io_ack</name>
              <description>SPI Master 0 SS[0] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss1_io_ack</name>
              <description>SPI Master 0 SS[1] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss2_io_ack</name>
              <description>SPI Master 0 SS[2] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss3_io_ack</name>
              <description>SPI Master 0 SS[3] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ss4_io_ack</name>
              <description>SPI Master 0 SS[4] I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_ack</name>
              <description>SPI Master 0 Quad I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Master 0 Fast Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

