ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- DSC2: Current Descriptor DWORD 2 -->
        <register>
          <name>DSC2</name>
          <description>Current Descriptor DWORD 2</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DSC3: Current Descriptor DWORD 3 -->
        <register>
          <name>DSC3</name>
          <description>Current Descriptor DWORD 3</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
        </register>

        <!-- DSC4: Current Descriptor DWORD 4 -->
        <register>
          <name>DSC4</name>
          <description>Current Descriptor DWORD 4</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
        </register>

      </registers>
    </peripheral>


    <!-- PMU:PMU1 -->

    <peripheral derivedFrom="PMU0">
      <name>PMU1</name>
      <groupName>PMU</groupName>
      <baseAddress>0x40005020</baseAddress>
    </peripheral>


    <!-- PMU:PMU2 -->

    <peripheral derivedFrom="PMU0">
      <name>PMU2</name>
      <groupName>PMU</groupName>
      <baseAddress>0x40005040</baseAddress>
    </peripheral>


    <!-- PMU:PMU3 -->

    <peripheral derivedFrom="PMU0">
      <name>PMU3</name>
      <groupName>PMU</groupName>
      <baseAddress>0x40005060</baseAddress>
    </peripheral>


    <!-- PMU:PMU4 -->

    <peripheral derivedFrom="PMU0">
      <name>PMU4</name>
      <groupName>PMU</groupName>
      <baseAddress>0x40005080</baseAddress>
    </peripheral>


    <!-- PMU:PMU5 -->

    <peripheral derivedFrom="PMU0">
      <name>PMU5</name>
      <groupName>PMU</groupName>
      <baseAddress>0x400050A0</baseAddress>
    </peripheral>


    <!-- USB:USB -->

    <peripheral>
      <name>USB</name>
      <description>USB Device Controller</description>
      <!-- <groupName>USB</groupName> -->
      <baseAddress>0x40100000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB</name>
        <value>8</value>
        <description>USB IRQ</description>
      </interrupt>
      <registers>

        <!-- CN: USB Control Register -->
        <register>
          <name>CN</name>
          <description>USB Control Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>usb_en</name>
              <description>USB Device Interface Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- DEV_ADDR: USB Device Address Register -->
        <register>
          <name>DEV_ADDR</name>
          <description>USB Device Address Register</description>
          <addressOffset>0x0200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>dev_addr</name>
              <description>USB Device Address</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- DEV_CN: USB Device Control Register -->
        <register>
          <name>DEV_CN</name>
          <description>USB Device Control Register</description>
          <addressOffset>0x0204</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>sigrwu</name>
              <description>USB Signal Remote Wakeup</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>connect</name>
              <description>Connect to USB</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ulpm</name>
              <description>USB Low Power Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>urst</name>
              <description>USB Device Controller Reset</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vbgate</name>
              <description>VBUS Gate</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fifo_mode</name>
              <description>FIFO Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- DEV_INTFL: USB Device Interrupt -->
        <register>
          <name>DEV_INTFL</name>
          <description>USB Device Interrupt</description>
          <addressOffset>0x0208</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>dpact</name>
              <description>DPLUS Activity Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rwu_dn</name>
              <description>Remote Wakeup Done Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>bact</name>
              <description>USB Bus Activity Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>brst</name>
              <description>USB Bus Reset In Progress Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>susp</name>
              <description>USB Suspend Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>no_vbus</name>
              <description>No VBUS Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>vbus</name>
              <description>VBUS Detect Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>brst_dn</name>
              <description>USB Bus Reset Completed Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>setup</name>
              <description>Setup Packet Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ep_in</name>
              <description>Endpoint IN Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ep_out</name>
              <description>Endpoint OUT Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ep_nak</name>
              <description>Endpoint NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err</name>
              <description>DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr</name>
              <description>Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>vbus_st</name>
              <description>VBUS Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- DEV_INTEN: USB Device Interrupt Enable -->
        <register>
          <name>DEV_INTEN</name>
          <description>USB Device Interrupt Enable</description>
          <addressOffset>0x020C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>dpact</name>
              <description>DPLUS Activity Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rwu_dn</name>
              <description>Remote Wakeup Done Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bact</name>
              <description>USB Bus Activity Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>brst</name>
              <description>USB Bus Reset In Progress Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>susp</name>
              <description>USB Suspend Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>no_vbus</name>
              <description>No VBUS Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>vbus</name>
              <description>VBUS Detect Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>brst_dn</name>
              <description>USB Bus Reset Completed Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>setup</name>
              <description>Setup Packet Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_in</name>
              <description>Endpoint IN Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_out</name>
              <description>Endpoint OUT Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak</name>
              <description>Endpoint NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>dma_err</name>
              <description>DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf_ovr</name>
              <description>Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- EP_BASE: USB Endpoint Descriptor Table Base Address -->
        <register>
          <name>EP_BASE</name>
          <description>USB Endpoint Descriptor Table Base Address</description>
          <addressOffset>0x0220</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_base</name>
              <description>USB Endpoint Descriptor Table Base Address</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CUR_BUF: USB Current Endpoint Buffer Register -->
        <register>
          <name>CUR_BUF</name>
          <description>USB Current Endpoint Buffer Register</description>
          <addressOffset>0x0224</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>out_buf</name>
              <description>OUT Transfer Current Buffers</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>in_buf</name>
              <description>IN Transfer Current Buffers</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- IN_OWNER: USB IN Endpoint Buffer Owner Register -->
        <register>
          <name>IN_OWNER</name>
          <description>USB IN Endpoint Buffer Owner Register</description>
          <addressOffset>0x0228</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>buf0_owner</name>
              <description>Owner for IN Buffer 0 for Endpoints</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf1_owner</name>
              <description>Owner for IN Buffer 1 for Endpoints</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- OUT_OWNER: USB OUT Endpoint Buffer Owner Register -->
        <register>
          <name>OUT_OWNER</name>
          <description>USB OUT Endpoint Buffer Owner Register</description>
          <addressOffset>0x022C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>buf0_owner</name>
              <description>Owner for OUT Buffer 0 for Endpoints</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>buf1_owner</name>
              <description>Owner for OUT Buffer 1 for Endpoints</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_INT: USB IN Endpoint Buffer Available Interrupt -->
        <register>
          <name>IN_INT</name>
          <description>USB IN Endpoint Buffer Available Interrupt</description>
          <addressOffset>0x0230</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>inbav0</name>
              <description>Endpoint 0 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav1</name>
              <description>Endpoint 1 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav2</name>
              <description>Endpoint 2 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav3</name>
              <description>Endpoint 3 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav4</name>
              <description>Endpoint 4 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav5</name>
              <description>Endpoint 5 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav6</name>
              <description>Endpoint 6 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>inbav7</name>
              <description>Endpoint 7 Buffer Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

