ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- OUT_INT: USB OUT Endpoint Data Available Interrupt -->
        <register>
          <name>OUT_INT</name>
          <description>USB OUT Endpoint Data Available Interrupt</description>
          <addressOffset>0x0234</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>outdav0</name>
              <description>Endpoint 0 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav1</name>
              <description>Endpoint 1 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav2</name>
              <description>Endpoint 2 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav3</name>
              <description>Endpoint 3 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav4</name>
              <description>Endpoint 4 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav5</name>
              <description>Endpoint 5 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav6</name>
              <description>Endpoint 6 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>outdav7</name>
              <description>Endpoint 7 Data Available Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- NAK_INT: USB IN Endpoint NAK Interrupt -->
        <register>
          <name>NAK_INT</name>
          <description>USB IN Endpoint NAK Interrupt</description>
          <addressOffset>0x0238</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>nak0</name>
              <description>Endpoint 0 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak1</name>
              <description>Endpoint 1 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak2</name>
              <description>Endpoint 2 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak3</name>
              <description>Endpoint 3 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak4</name>
              <description>Endpoint 4 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak5</name>
              <description>Endpoint 5 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak6</name>
              <description>Endpoint 6 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>nak7</name>
              <description>Endpoint 7 NAK Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- DMA_ERR_INT: USB DMA Error Interrupt -->
        <register>
          <name>DMA_ERR_INT</name>
          <description>USB DMA Error Interrupt</description>
          <addressOffset>0x023C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>dma_err0</name>
              <description>Endpoint 0 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err1</name>
              <description>Endpoint 1 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err2</name>
              <description>Endpoint 2 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err3</name>
              <description>Endpoint 3 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err4</name>
              <description>Endpoint 4 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err5</name>
              <description>Endpoint 5 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err6</name>
              <description>Endpoint 6 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>dma_err7</name>
              <description>Endpoint 7 DMA Error Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

