ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- RST_MODE_P8: Port P8 Default (Power-On Reset) Output Drive Mode -->
        <register>
          <name>RST_MODE_P8</name>
          <description>Port P8 Default (Power-On Reset) Output Drive Mode</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P8.0 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P8.1 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P8.2 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P8.3 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P8.4 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P8.5 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P8.6 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P8.7 Default Output Drive Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P0: Port P0 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P0</name>
          <description>Port P0 Free for GPIO Operation Flags</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P0.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P0.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P0.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P0.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P0.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P0.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P0.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P0.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FREE_P1: Port P1 Free for GPIO Operation Flags -->
        <register>
          <name>FREE_P1</name>
          <description>Port P1 Free for GPIO Operation Flags</description>
          <addressOffset>0x0044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P1.0 GPIO Mode Acknowledge </description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P1.1 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P1.2 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P1.3 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P1.4 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P1.5 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P1.6 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P1.7 GPIO Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

