ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- FUNC_SEL_P6: Port P6 GPIO Function Select -->
        <register>
          <name>FUNC_SEL_P6</name>
          <description>Port P6 GPIO Function Select</description>
          <addressOffset>0x0118</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FUNC_SEL_P7: Port P7 GPIO Function Select -->
        <register>
          <name>FUNC_SEL_P7</name>
          <description>Port P7 GPIO Function Select</description>
          <addressOffset>0x011C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P7.0 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P7.1 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P7.2 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P7.3 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P7.4 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P7.5 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P7.6 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P7.7 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FUNC_SEL_P8: Port P8 GPIO Function Select -->
        <register>
          <name>FUNC_SEL_P8</name>
          <description>Port P8 GPIO Function Select</description>
          <addressOffset>0x0120</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P8.0 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P8.1 Output Function Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P0: Port P0 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P0</name>
          <description>Port P0 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0140</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P0.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P0.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P0.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P0.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P0.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P0.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P0.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P0.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P1: Port P1 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P1</name>
          <description>Port P1 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P1.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P1.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P1.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P1.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P1.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P1.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P1.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P1.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P2: Port P2 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P2</name>
          <description>Port P2 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0148</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P2.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P2.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P2.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P2.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P2.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P2.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P2.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P2.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P3: Port P3 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P3</name>
          <description>Port P3 GPIO Input Monitoring Mode</description>
          <addressOffset>0x014C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P3.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P3.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P3.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P3.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P3.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P3.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P3.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P3.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

