ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- COUNT16_1: [16 bit] Current Count Value, 16-bit Timer 1 -->
        <register>
          <name>COUNT16_1</name>
          <description>[16 bit] Current Count Value, 16-bit Timer 1</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>value</name>
              <description>Count Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TERM_CNT16_1: [16 bit] Terminal Count Setting, 16-bit Timer 1 -->
        <register>
          <name>TERM_CNT16_1</name>
          <description>[16 bit] Terminal Count Setting, 16-bit Timer 1</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>term_count</name>
              <description>Terminal Count Setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTFL: Timer Module Interrupt Flags -->
        <register>
          <name>INTFL</name>
          <description>Timer Module Interrupt Flags</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>timer0</name>
              <description>Interrupt Flag for 32-bit Timer / 16-bit Timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>timer1</name>
              <description>Interrupt Flag for 16-bit Timer 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- INTEN: Timer Module Interrupt Enable/Disable Settings -->
        <register>
          <name>INTEN</name>
          <description>Timer Module Interrupt Enable/Disable Settings</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>timer0</name>
              <description>Interrupt Enable for 32-bit Timer / 16-bit Timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>timer1</name>
              <description>Interrupt Enable for 16-bit Timer 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- TMR:TMR1 -->

    <peripheral derivedFrom="TMR0">
      <name>TMR1</name>
      <groupName>Timers</groupName>
      <baseAddress>0x4000C000</baseAddress>
      <interrupt>
        <name>TMR1</name>
        <value>24</value>
        <description>Timer 1 IRQ</description>
      </interrupt>
      <interrupt>
        <name>TMR16_1</name>
        <value>25</value>
        <description>16-bit Timer 1 IRQ</description>
      </interrupt>
    </peripheral>


    <!-- TMR:TMR2 -->

    <peripheral derivedFrom="TMR0">
      <name>TMR2</name>
      <groupName>Timers</groupName>
      <baseAddress>0x4000D000</baseAddress>
      <interrupt>
        <name>TMR2</name>
        <value>26</value>
        <description>Timer 2 IRQ</description>
      </interrupt>
      <interrupt>
        <name>TMR16_2</name>
        <value>27</value>
        <description>16-bit Timer 2 IRQ</description>
      </interrupt>
    </peripheral>


    <!-- TMR:TMR3 -->

    <peripheral derivedFrom="TMR0">
      <name>TMR3</name>
      <groupName>Timers</groupName>
      <baseAddress>0x4000E000</baseAddress>
      <interrupt><name>TMR3</name><value>28</value><description>Timer 3 IRQ</description></interrupt>
      <interrupt>
        <name>TMR16_3</name>
        <value>29</value>
        <description>16-bit Timer 3 IRQ</description>
      </interrupt>
    </peripheral>


    <!-- TMR:TMR4 -->

    <peripheral derivedFrom="TMR0">
      <name>TMR4</name>
      <groupName>Timers</groupName>
      <baseAddress>0x4000F000</baseAddress>
      <interrupt>
        <name>TMR4</name>
        <value>30</value>
        <description>Timer 4 IRQ</description>
      </interrupt>
      <interrupt>
        <name>TMR16_4</name>
        <value>31</value>
        <description>16-bit Timer 4 IRQ</description>
      </interrupt>
    </peripheral>


    <!-- TMR:TMR5 -->

    <peripheral derivedFrom="TMR0">
      <name>TMR5</name>
      <groupName>Timers</groupName>
      <baseAddress>0x40010000</baseAddress>
      <interrupt>
        <name>TMR5</name>
        <value>32</value>
        <description>Timer 5 IRQ</description>
      </interrupt>
      <interrupt>
        <name>TMR16_5</name>
        <value>33</value>
        <description>16-bit Timer 5 IRQ</description>
      </interrupt>
    </peripheral>


    <!-- UART:UART0 -->

    <peripheral>
      <name>UART0</name>
      <description>UART / Serial Port Interface</description>
      <groupName>UARTs</groupName>
      <baseAddress>0x40012000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>34</value>
        <description>UART 0 IRQ</description>
      </interrupt>
      <registers>
        <!-- CTRL: UART Control Register -->
        <register>
          <name>CTRL</name>
          <description>UART Control Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>uart_en</name>
              <description>UART Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_en</name>
              <description>RX FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_en</name>
              <description>TX FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>data_size</name>
              <description>Data Size</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>extra_stop</name>
              <description>Extra Stop Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>parity</name>
              <description>Parity Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_en</name>
              <description>CTS Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_polarity</name>
              <description>CTS Polarity</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_en</name>
              <description>RTS Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_polarity</name>
              <description>RTS Polarity</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rts_level</name>
              <description>RX FIFO LTE Level for RTS Assert</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- BAUD: UART Baud Control Register -->
        <register>
          <name>BAUD</name>
          <description>UART Baud Control Register</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>baud_divisor</name>
              <description>Baud Divisor</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TX_FIFO_CTRL: UART TX Fifo Control Register -->
        <register>
          <name>TX_FIFO_CTRL</name>
          <description>UART TX Fifo Control Register</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fifo_entry</name>
              <description>TX FIFO Entries</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_ae_lvl</name>
              <description>TX FIFO AE Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RX_FIFO_CTRL: UART RX Fifo Control Register -->
        <register>
          <name>RX_FIFO_CTRL</name>
          <description>UART RX Fifo Control Register</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fifo_entry</name>
              <description>RX FIFO Entries</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fifo_af_lvl</name>
              <description>RX FIFO AF Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- MD_CTRL: UART Multidrop Control Register -->
        <register>
          <name>MD_CTRL</name>
          <description>UART Multidrop Control Register</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>slave_addr</name>
              <description>Slave Address</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>slave_addr_msk</name>
              <description>Slave Address Mask</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>md_mstr</name>
              <description>Multidrop Master</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_addr_mark</name>
              <description>RX Address Mark</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

