ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
      </registers>
    </peripheral>


    <!-- UART:UART1 -->

    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <groupName>UARTs</groupName>
      <interrupt>
        <name>UART1</name>
        <value>35</value>
        <description>UART 1 IRQ</description>
      </interrupt>
      <baseAddress>0x40013000</baseAddress>
    </peripheral>


    <!-- UART:UART2 -->

    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <groupName>UARTs</groupName>
      <interrupt>
        <name>UART2</name>
        <value>36</value>
        <description>UART 2 IRQ</description>
      </interrupt>
      <baseAddress>0x40014000</baseAddress>
    </peripheral>


    <!-- UART:UART3 -->

    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <groupName>UARTs</groupName>
      <interrupt>
        <name>UART3</name>
        <value>37</value>
        <description>UART 3 IRQ</description>
      </interrupt>
      <baseAddress>0x40015000</baseAddress>
    </peripheral>

    <!-- PT:PTG -->

    <peripheral>
      <name>PTG</name>
      <description>Pulse Train Generation</description>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0010</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PT</name>
        <value>38</value>
        <description>Pulse Train IRQ</description>
      </interrupt>
      <registers>

        <!-- ENABLE: Global Enable/Disable Controls for All Pulse Trains -->
        <register>
          <name>ENABLE</name>
          <description>Global Enable/Disable Controls for All Pulse Trains</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pt0</name>
              <description>Enable/Disable control for PT0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt1</name>
              <description>Enable/Disable control for PT1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt2</name>
              <description>Enable/Disable control for PT2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt3</name>
              <description>Enable/Disable control for PT3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt4</name>
              <description>Enable/Disable control for PT4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt5</name>
              <description>Enable/Disable control for PT5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt6</name>
              <description>Enable/Disable control for PT6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt7</name>
              <description>Enable/Disable control for PT7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt8</name>
              <description>Enable/Disable control for PT8</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt9</name>
              <description>Enable/Disable control for PT9</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt10</name>
              <description>Enable/Disable control for PT10</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt11</name>
              <description>Enable/Disable control for PT11</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt12</name>
              <description>Enable/Disable control for PT12</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt13</name>
              <description>Enable/Disable control for PT13</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt14</name>
              <description>Enable/Disable control for PT14</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt15</name>
              <description>Enable/Disable control for PT15</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RESYNC: Global Resync (All Pulse Trains) Control -->
        <register>
          <name>RESYNC</name>
          <description>Global Resync (All Pulse Trains) Control</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pt0</name>
              <description>Resync control for PT0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt1</name>
              <description>Resync control for PT1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt2</name>
              <description>Resync control for PT2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt3</name>
              <description>Resync control for PT3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt4</name>
              <description>Resync control for PT4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt5</name>
              <description>Resync control for PT5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt6</name>
              <description>Resync control for PT6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt7</name>
              <description>Resync control for PT7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt8</name>
              <description>Resync control for PT8</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt9</name>
              <description>Resync control for PT9</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt10</name>
              <description>Resync control for PT10</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt11</name>
              <description>Resync control for PT11</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt12</name>
              <description>Resync control for PT12</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt13</name>
              <description>Resync control for PT13</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt14</name>
              <description>Resync control for PT14</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt15</name>
              <description>Resync control for PT15</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTFL: Pulse Train Interrupt Flags -->
        <register>
          <name>INTFL</name>
          <description>Pulse Train Interrupt Flags</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pt0</name>
              <description>Pulse Train 0 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt1</name>
              <description>Pulse Train 1 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt2</name>
              <description>Pulse Train 2 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt3</name>
              <description>Pulse Train 3 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt4</name>
              <description>Pulse Train 4 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt5</name>
              <description>Pulse Train 5 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt6</name>
              <description>Pulse Train 6 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt7</name>
              <description>Pulse Train 7 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt8</name>
              <description>Pulse Train 8 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt9</name>
              <description>Pulse Train 9 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt10</name>
              <description>Pulse Train 10 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt11</name>
              <description>Pulse Train 11 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt12</name>
              <description>Pulse Train 12 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt13</name>
              <description>Pulse Train 13 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt14</name>
              <description>Pulse Train 14 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pt15</name>
              <description>Pulse Train 15 Stopped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

