ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
      </registers>
    </peripheral>


    <!-- PT:PT1 -->

    <peripheral derivedFrom="PT0">
      <name>PT1</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001101C</baseAddress>
    </peripheral>


    <!-- PT:PT2 -->

    <peripheral derivedFrom="PT0">
      <name>PT2</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011028</baseAddress>
    </peripheral>


    <!-- PT:PT3 -->

    <peripheral derivedFrom="PT0">
      <name>PT3</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011034</baseAddress>
    </peripheral>


    <!-- PT:PT4 -->

    <peripheral derivedFrom="PT0">
      <name>PT4</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011040</baseAddress>
    </peripheral>


    <!-- PT:PT5 -->

    <peripheral derivedFrom="PT0">
      <name>PT5</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001104C</baseAddress>
    </peripheral>


    <!-- PT:PT6 -->

    <peripheral derivedFrom="PT0">
      <name>PT6</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011058</baseAddress>
    </peripheral>


    <!-- PT:PT7 -->

    <peripheral derivedFrom="PT0">
      <name>PT7</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011064</baseAddress>
    </peripheral>


    <!-- PT:PT8 -->

    <peripheral derivedFrom="PT0">
      <name>PT8</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011070</baseAddress>
    </peripheral>


    <!-- PT:PT9 -->

    <peripheral derivedFrom="PT0">
      <name>PT9</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x4001107C</baseAddress>
    </peripheral>


    <!-- PT:PT10 -->

    <peripheral derivedFrom="PT0">
      <name>PT10</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011088</baseAddress>
    </peripheral>


    <!-- PT:PT11 -->

    <peripheral derivedFrom="PT0">
      <name>PT11</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x40011094</baseAddress>
    </peripheral>


    <!-- PT:PT12 -->

    <peripheral derivedFrom="PT0">
      <name>PT12</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110A0</baseAddress>
    </peripheral>


    <!-- PT:PT13 -->

    <peripheral derivedFrom="PT0">
      <name>PT13</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110AC</baseAddress>
    </peripheral>


    <!-- PT:PT14 -->

    <peripheral derivedFrom="PT0">
      <name>PT14</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110B8</baseAddress>
    </peripheral>


    <!-- PT:PT15 -->

    <peripheral derivedFrom="PT0">
      <name>PT15</name>
      <groupName>Pulse Train</groupName>
      <baseAddress>0x400110C4</baseAddress>
    </peripheral>


    <!-- I2C:I2CM0 -->

    <peripheral>
      <name>I2CM0</name>
      <description>I2C Master 0 Interface</description>
      <groupName>I2C Master</groupName>
      <baseAddress>0x40016000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2CM0</name>
        <value>39</value>
        <description>I2C Master 0 IRQ</description>
      </interrupt>
      <registers>

        <!-- FS_CLK_DIV: Full Speed SCL Clock Settings -->
        <register>
          <name>FS_CLK_DIV</name>
          <description>Full Speed SCL Clock Settings</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fs_filter_clk_div</name>
              <description>Full Speed Filter Clock Divisor</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fs_scl_lo_cnt</name>
              <description>Full Speed SCL Low Count</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fs_scl_hi_cnt</name>
              <description>Full Speed SCL High Count</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TIMEOUT: Timeout and Auto-Stop Settings -->
        <register>
          <name>TIMEOUT</name>
          <description>Timeout and Auto-Stop Settings</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_timeout</name>
              <description>Transaction Timeout Limit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_stop_en</name>
              <description>Auto-Stop Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- CTRL: I2C Master Control Register -->
        <register>
          <name>CTRL</name>
          <description>I2C Master Control Register</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_fifo_en</name>
              <description>Master Transaction FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_en</name>
              <description>Master Results FIFO Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mstr_reset_en</name>
              <description>Master Reset</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TRANS: I2C Master Transaction Start and Status Flags -->
        <register>
          <name>TRANS</name>
          <description>I2C Master Transaction Start and Status Flags</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_start</name>
              <description>Start Transaction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_in_progress</name>
              <description>Transaction In Progress</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_done</name>
              <description>Transaction Done</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_nacked</name>
              <description>Transaction Nacked</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_lost_arbitr</name>
              <description>Transaction Lost Arbitration</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_timeout</name>
              <description>Transaction Timed Out</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- INTFL: Interrupt Flags -->
        <register>
          <name>INTFL</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_done</name>
              <description>Transaction Done Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_nacked</name>
              <description>Transaction NACKed Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_lost_arbitr</name>
              <description>Transaction Lost Arbitration Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_timeout</name>
              <description>Transaction Timed Out Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_fifo_empty</name>
              <description>Transaction FIFO Empty Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_fifo_3q_empty</name>
              <description>Transaction FIFO 3Q Empty Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_fifo_not_empty</name>
              <description>Results FIFO Not Empty Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_fifo_2q_full</name>
              <description>Results FIFO 2Q Full Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_fifo_3q_full</name>
              <description>Results FIFO 3Q Full Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_fifo_full</name>
              <description>Results FIFO Full Int Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- INTEN: Interrupt Enable/Disable Controls -->
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable/Disable Controls</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_done</name>
              <description>Transaction Done Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_nacked</name>
              <description>Transaction NACKed Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_lost_arbitr</name>
              <description>Transaction Lost Arbitration IntEnable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_timeout</name>
              <description>Transaction Timed Out Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_empty</name>
              <description>Transaction FIFO Empty Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_3q_empty</name>
              <description>Transaction FIFO 3Q Empty Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_not_empty</name>
              <description>Results FIFO Not Empty Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_2q_full</name>
              <description>Results FIFO 2Q Full Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_3q_full</name>
              <description>Results FIFO 3Q Full Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_full</name>
              <description>Results FIFO Full Int Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- BB: Bit-Bang Control Register -->
        <register>
          <name>BB</name>
          <description>Bit-Bang Control Register</description>
          <addressOffset>0x0028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>bb_scl_out</name>
              <description>Bit Bang SCL Output</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bb_sda_out</name>
              <description>Bit Bang SDA Output</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bb_scl_in_val</name>
              <description>Bit Bang SCL Input Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>bb_sda_in_val</name>
              <description>Bit Bang SCL Input Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_cnt</name>
              <description>Results FIFO Data Received Count</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

