ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/MAX3262x/MAX32625/max32625.svd
        <!-- RO_CAL1: RO Trim Calibration Register 1 -->
        <register>
          <name>RO_CAL1</name>
          <description>RO Trim Calibration Register 1</description>
          <addressOffset>0x0028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>trm_init</name>
              <description>RO Trim Initial Value</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trm_min</name>
              <description>RO Trim Maximum Adaptive Limit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>trm_max</name>
              <description>RO Trim Minimum Adaptive Limit</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- RO_CAL2: RO Trim Calibration Register 2 -->
        <register>
          <name>RO_CAL2</name>
          <description>RO Trim Calibration Register 2</description>
          <addressOffset>0x002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>auto_cal_done_cnt</name>
              <description>Auto Cal Time Delay for Atomic Calibration (in milliseconds)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- SPIS:SPIS -->

    <peripheral>
      <name>SPIS</name>
      <description>SPI Slave Interface</description>
      <groupName>SPI Slave</groupName>
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPIS</name>
        <value>49</value>
        <description>SPI Slave IRQ</description>
      </interrupt>
      <registers>

        <!-- GEN_CTRL: SPI Slave General Control Register -->
        <register>
          <name>GEN_CTRL</name>
          <description>SPI Slave General Control Register</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spi_slave_en</name>
              <description>SPI Slave Enable</description>
              <enumeratedValues>
                <name>Enable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SPI Slave</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPI Slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_fifo_en</name>
              <description>TX FIFO Enable</description>
              <enumeratedValues>
                <name>Enable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SPI Slave TX FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPI Slave TX FIFO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_en</name>
              <description>SPI RX FIFO Enable</description>
              <enumeratedValues>
                <name>Enable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SPI Slave RX FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPI Slave RX FIFO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>

              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>data_width</name>
              <description>Width of SPI Slave Data Transfers</description>
              <enumeratedValues>
                <name>Enable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>x1</name>
                  <description>1-bit Wide</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>x2</name>
                  <description>2-bit Wide/Dual</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>x4</name>
                  <description>4-bit Wide/Quad</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid</name>
                  <description>Reserved for future use. Do not use.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_mode</name>
              <description>Defines Clock Polarity (bit 17) and Clock Phase (bit 16), collectively referred to as SPI Mode.</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_clk_invert</name>
              <description>Invert TX Clock</description>
              <enumeratedValues>
                <name>Enable</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>No Effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Invert</name>
                  <description>Inverts the TX transmit clock such that outgoing data is updated on the opposite clock edge from that specified by spi_mode. Effectively, this inverts the value of the Clock Polarity bit from the value specified in spi_mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>disable_parking</name>
              <description>Disable automatic resetting of SPI Slave on exit from LP Modes</description>
              <enumeratedValues>
              </enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

